tutorials/modules/multicomponentFluid/counterFlowFlame2D_GRI/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication decomposePar -cellProc
runParallel $(getApplication)
runApplication reconstructPar -cellProc

#------------------------------------------------------------------------------
